/*
*********************************************************************************************************
*
*	模块名称 : 主函数
*	文件名称 : main.h
*	版    本 : V0.0.0
*	说    明 : 主函数需要调用的头文件
*	修改记录 :
*
*		版本号     日期      作者    说明
*		V0.0.0     无       高屹    随时修改
*
*	Copyright (C), 2020-2030,  辽宁思凯-高屹
*
*********************************************************************************************************
*/
#ifndef __MAIN_H__
#define __MAIN_H__

/* include */
#include "api_define_all.h"
#include "event.h"
#include "12864.h"
#include "malloc.h"
#include "cjsontest.h"

#endif
